# DBeam_SetRShutDepth

```pascal
PROCEDURE DBeam_SetRShutDepth(depth : INTEGER);
```

```python
def vs.DBeam_SetRShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight